
_InstTypes = {
    'A':'政策性银行',
    'B':'商业银行',
    'C':'农村合作银行',
    'D':'城市信用社',
    'E':'农村信用社',
    'F':'资金互助社',
    'J':'金融资产管理公司',
    'K':'信托公司',
    'L':'财务公司',
    'M':'金融租赁公司',
    'N':'汽车金融公司',
    'P':'货币经纪公司',
    'Q':'贷款公司',
    'Z':'其他类金融机构',
}

_OrganTypes = {
    'A':{
        'H':'总行',
        'G':'总行营业部',
        'B':'一级分行',
        'K':'一级分行营业部',
        'M':'二级分行',
        'S':'支行',
        'X':'其他分支机构',
    },
    'B':{
        'H':'总行',
        'G':'总行营业部、专营机构',
        'B':'一级分行',
        'K':'一级分行营业部',
        'L':'二级分行',
        'M':'直属支行',
        'N':'二级分行营业部',
        'S':'支行',
        'U':'分理处、办事处、营业所',
        'V':'储蓄所',
        'X':'其他分支机构',
    },
    'C':{
        'H':'总行',
        'S':'支行',
        'U':'分理处',
        'V':'储蓄所',
        'X':'其他分支机构',
    },
    'D':{
        'H':'法人',
        'S':'分社、营业部',
        'X':'其他分支机构',
    },
    'E':{
        'H':'省(自治区、直辖市)联合社',
        'B':'地(市)联合社、联社',
        'S':'县(市)联合社、联社、合作社(县级)',
        'T':'信用合作社',
        'U':'信用社、分社',
        'V':'储蓄所',
        'X':'其他分支机构',
    },
    'F':{
        'H':'法人',
    },
    'J':{
        'H':'总公司',
        'B':'办事处',
        'X':'其他分支机构',
    },
    'K':{
        'H':'法人',
    },
    'N':{
        'H':'法人',
    },
    'L':{
        'H':'总公司',
        'B':'分公司',
        'X':'其他分支机构',
    },
    'M':{
        'H':'总公司',
        'B':'分公司',
        'X':'其他分支机构',
    },
    'P':{
        'H':'总公司',
        'B':'分公司',
        'X':'其他分支机构',
    },
    'Q':{
        'H':'总公司',
        'B':'分公司',
        'X':'其他分支机构',
    },
    'Z':{
        'H':'总公司',
        'B':'分公司',
        'X':'其他分支机构',
    }
}

_IssueDepts = {
    '1':'银监会',
    '2':'银监局',
    '3':'银监分局',
}

def resolve(code):
    if len(code) != 15:
        return (['']*6)
    instTypeCode = code[:1]
    instCode = code[1:5]
    organTypeCode = code[5:6]
    issueOrganTypeCode = code[6:7]
    areaCode = code[7:11]
    indexCode = code[11:15]

    return (
        _InstTypes.get(instTypeCode, ''),
        instCode,
        _OrganTypes.get(instTypeCode, {}).get(organTypeCode, ''),
        _IssueDepts.get(issueOrganTypeCode, ''),
        areaCode,
        indexCode,   
    )

if __name__ == '__main__':
    print(resolve('B0009H111000001'))
    print(resolve('B0009B211000001'))
    print(resolve('B0009S211000008'))

